tap "asmvik/formulae"
tap "nikitabobko/tap"
brew "m4"
brew "bison"
brew "expat"
brew "flex"
brew "flock"
brew "gawk"
brew "gnu-sed"
brew "isl"
brew "libmpc"
brew "libslirp"
brew "make"
brew "ncurses"
brew "ninja"
brew "node"
brew "pyenv"
brew "python@3.14"
brew "texinfo"
brew "tmux"
brew "tree-sitter-cli"
brew "typst"
brew "wget"
brew "zlib"
brew "zoxide"
cask "nikitabobko/tap/aerospace"
cask "font-hack-nerd-font"
vscode "aaron-bond.better-comments"
vscode "bradgashler.htmltagwrap"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hollowtree.vue-snippets"
vscode "james-yu.latex-workshop"
vscode "magicstack.magicpython"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ocamllabs.ocaml-platform"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "raunofreiberg.vesper"
vscode "redhat.java"
vscode "salbert.copy-text"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
go "bitplan"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "todo"
