tap "domt4/chromium"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Ruby environment tool
brew "chruby"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GNU triangulated surface library
brew "gts"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Portable Foreign Function Interface library
brew "libffi"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# YAML Parser
brew "libyaml"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Object-relational database system
brew "postgresql@16"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.0"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ncurses based mpd client with vi like key bindings
brew "vimpc"
# Internet file retriever
brew "wget"
cask "font-meslo-lg-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
vscode "aaron-bond.better-comments"
vscode "bradgashler.htmltagwrap"
vscode "catppuccin.catppuccin-vsc"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hollowtree.vue-snippets"
vscode "jdinhlife.gruvbox"
vscode "magicstack.magicpython"
vscode "maximetinu.identical-sublime-monokai-csharp-theme-colorizer"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "mvllow.rose-pine"
vscode "pkief.material-icon-theme"
vscode "salbert.copy-text"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vscodevim.vim"
vscode "vue.volar"
